package study.java.collection.searchcollection;

public class A_Search {
    /*
    * 검색기능 강화 컬렉션
    * 종류는 TreeSet, TreeMap이 있으며 이진트리를 이용하여 계층적 구조를 가지며 객체를 저장한다
    *
    * -이진트리
    * 이름에서 알수있다시피 트리구조를 가지며 1개의 부모노드는 최대 두개의 자식노드를 가지는 구조이다.
    * 여기서 2개의 자식 노드중 부모노드보다 값이 작은 경우 왼쪽 자식노드 값이 클 경우 오른쪽 자식노드의 위치하게 된다.
    * 문자를 저장하는 경우에는 유니코드로 변환되어 저장된다.
    *
    * -TreeSet
    * 위에서 설명한 이진트리의 구조를 가지고 있으며 검색 관련 메소드들을 제공하기 떄문에 Set을 이용하여 저장후 검색하는 경우 TreeSet을 이용하면 된다.
    *
    * -TreeMap
    * TreeSet과 같지만 map형식으로 저장한다는 특징이 있다.
    *
    * -Comparable
    * 해당 인터페이스는 정렬과 관련되어있는데 이 인터페이스를 구현한 객체는 정렬 기능을 사용할 수 있다.
    * (Integer, Double, String은 구현되어 있다.)
    * 구현 안되어있는 클래스가 해당 인터페이스를 상속 받으면  compareTo() 메소드를 정의해줘야한다.
    *
    * -Comparator
    * 정렬자로써 객체가 Comparable 인터페이스를 상속받지 않고 객체를 생성할때 매개값으로 정렬자를 넘겨주는 방법이다.
    * 정렬자를 따로 구현해준다음 매개변수로 넘겨주는 방식
    * */
}
